<?xml version="1.0" ?><policyDefinitionResources revision="1.0" schemaVersion="1.0" xmlns="http://www.microsoft.com/GroupPolicy/PolicyDefinitions"><!--microsoft_edge version: 102.0.1245.30--><displayName/><description/><resources><stringTable><string id="WebView2LoaderOverrideSettings_group">Configuración de invalidación de cargador</string><string id="BrowserExecutableFolder">Configurar la ubicación de la carpeta ejecutable del explorador</string><string id="BrowserExecutableFolder_Explain">Esta directiva configura las aplicaciones de WebView2 para usar el tiempo de ejecución WebView2 en la ruta de acceso especificada. La carpeta debe contener los siguientes archivos: msedgewebview2.exe, msedge.dll, etc.

Para establecer el valor para la ruta de acceso de la carpeta, especifique un nombre de valor y un par de valor. Configure el nombre de valor en el Id. del modelo de usuario de la aplicación o el nombre del archivo ejecutable. Puede usar el carácter comodín &quot;*&quot; como nombre de valor para aplicarlo a todas las aplicaciones.

Valor de ejemplo:

Name: *, Value: C:\Program Files\Microsoft Edge WebView2 Runtime Redistributable 85.0.541.0 x64</string><string id="BrowserExecutableFolderDesc">Configurar la ubicación de la carpeta ejecutable del explorador</string><string id="ReleaseChannelPreference">Establecer las preferencias de orden de búsqueda por canales de lanzamiento</string><string id="ReleaseChannelPreference_Explain">El orden de búsqueda por canales predeterminado es WebView2 Runtime, Beta, Dev y Canary.

Para invertir el orden de búsqueda predeterminado, establezca esta directiva en 1.

Para establecer el valor de las preferencias de canales de lanzamiento, especifique un nombre de valor y un par de valor. Configure el nombre de valor en el Id. del modelo de usuario de la aplicación o el nombre del archivo ejecutable. Puede usar el carácter comodín &quot;*&quot; como nombre de valor para aplicar a todas las aplicaciones.

Valor de ejemplo:

Name: *, Value: 1</string><string id="ReleaseChannelPreferenceDesc">Establecer las preferencias de orden de búsqueda por canales de lanzamiento</string><string id="ExperimentationAndConfigurationServiceControl">Controlar la comunicación con el servicio de experimentación y configuración</string><string id="ExperimentationAndConfigurationServiceControl_Explain">El servicio de experimentación y configuración se usa para implementar cargas de experimentación y configuración en el cliente.

La carga de experimentación consta de una lista de características de desarrollo temprano que Microsoft está habilitando para pruebas y comentarios.

La carga de configuración consta de una lista de opciones recomendadas que Microsoft quiere implementar para optimizar la experiencia del usuario.

La carga de configuración también puede contener una lista de acciones que se deben realizar en determinados dominios por motivos de compatibilidad. Por ejemplo, el explorador puede invalidar la cadena del agente de usuario en un sitio web si ese sitio web no funciona. Todas estas acciones son temporales hasta que Microsoft resuelva el problema con el propietario del sitio.

Si establece esta directiva en &quot;FullMode&quot;, la carga completa se descargará del servicio de experimentación y configuración. Esto incluye las cargas de experimentación y configuración.

Si establece esta directiva en &quot;ConfigurationsOnlyMode&quot;, solo se descargará la carga de configuración.

Si establece esta directiva en &quot;RestrictedMode&quot;, la comunicación con el servicio de experimentación y configuración se detiene por completo. Microsoft no recomienda esta configuración.

Si no configura esta directiva en un dispositivo administrado, el comportamiento en los canales Beta y Estable será el mismo que el de &quot;ConfigurationsOnlyMode&quot;. En los canales Canary y Dev, el comportamiento es el mismo que &quot;FullMode&quot;.

Si no configura esta directiva en un dispositivo no administrado, el comportamiento será el mismo que el de &quot;FullMode&quot;.

Asignación de opciones de directiva:

* FullMode (2) = Recuperar configuraciones y experimentos

* ConfigurationsOnlyMode (1) = Recuperar solo configuraciones

* RestrictedMode (0) = Deshabilitar la comunicación con el servicio de experimentación y configuración

Usa la información anterior al configurar esta directiva.</string><string id="ExperimentationAndConfigurationServiceControl_FullMode">Recuperar configuraciones y experimentos</string><string id="ExperimentationAndConfigurationServiceControl_ConfigurationsOnlyMode">Recuperar solo configuraciones</string><string id="ExperimentationAndConfigurationServiceControl_RestrictedMode">Deshabilitar la comunicación con el servicio de experimentación y configuración</string><string id="SUPPORTED_WIN7_V97">Microsoft Edge, versión 97, Windows 7 o posterior</string><string id="SUPPORTED_WIN7_V87">Microsoft Edge, versión 87, Windows 7 o posterior</string><string id="microsoft_edge_webview2">Microsoft Edge WebView2</string><string id="microsoft_edge_webview2_recommended">Microsoft Edge WebView2 - Configuración predeterminada (los usuarios pueden cambiarla)</string></stringTable><presentationTable><presentation id="BrowserExecutableFolder"><listBox refId="BrowserExecutableFolderDesc">Establece el nombre del valor en el identificador del modelo de usuario de la aplicación o en el nombre del archivo ejecutable. Puede usar el carácter comodín &quot;*&quot; como nombre de valor para aplicarlo a todas las aplicaciones.</listBox></presentation><presentation id="ReleaseChannelPreference"><listBox refId="ReleaseChannelPreferenceDesc">Establece el nombre del valor en el identificador del modelo de usuario de la aplicación o en el nombre del archivo ejecutable. Puede usar el carácter comodín &quot;*&quot; como nombre de valor para aplicarlo a todas las aplicaciones.</listBox></presentation><presentation id="ExperimentationAndConfigurationServiceControl"><dropdownList refId="ExperimentationAndConfigurationServiceControl">Controlar la comunicación con el servicio de experimentación y configuración</dropdownList></presentation></presentationTable></resources></policyDefinitionResources>